{
  "id": "12-0",
  "name": "The Literature Explorer",
  "type": "literature_review",
  "description": "A senior researcher points to a terminal displaying a research question. 'Effective literature reviews require systematic approaches,' they explain. 'Show me you can craft a prompt that thoroughly explores academic literature.'",
  "promptTask": "**Craft a Literature Review Prompt**: As a Research Librarian (Role), conduct a comprehensive literature review (Task) on the relationship between sleep quality and cognitive performance in adults (Subject), identifying key theories, methodological approaches, major findings, and research gaps (Elements), using peer-reviewed sources from the past 10 years (Constraints), and synthesizing the information into thematic categories (Format).",
  "solveConditions": {
    "keywords": ["conduct", "perform", "create", "synthesize", "review"],
    "target": "literature review|research review|systematic review",
    "requiredPersona": ["research librarian", "academic researcher", "scientific reviewer", "literature specialist"],
    "requiredFormat": ["thematic", "synthesis", "comprehensive", "systematic"],
    "requiredKeywordsContext": ["peer-reviewed", "theories", "methodological", "findings", "gaps", "synthesize"]
  },
  "successMessage": "The terminal processes your prompt, generating a comprehensive literature review...\n\n```\nLITERATURE REVIEW: SLEEP QUALITY AND COGNITIVE PERFORMANCE IN ADULTS\n\n1. INTRODUCTION\n\nThis review synthesizes peer-reviewed research from 2015-2025 examining the relationship between sleep quality and cognitive performance in adults. The literature reveals robust associations across multiple cognitive domains, though with varying methodological approaches and some contradictory findings.\n\n2. THEORETICAL FRAMEWORKS\n\n2.1 Restorative Theory of Sleep\n   • Posits that sleep quality directly impacts neural recovery and waste clearance\n   • Studies by Walker et al. (2019) and Zhang et al. (2022) provide neuroimaging evidence supporting this framework\n   • Links poor sleep quality to reduced glymphatic system efficiency and subsequent cognitive impairment\n\n2.2 Cognitive Reserve Model\n   • Proposes that individual differences in neural networks moderate sleep-cognition relationships\n   • Research by Stern et al. (2020) demonstrates how cognitive reserve may buffer negative effects of poor sleep\n   • Explains inconsistent findings across different population samples\n\n2.3 Circadian Neurocognitive Framework\n   • Emphasizes timing of sleep rather than just duration or quality\n   • Studies by Dijk & Archer (2017) show circadian misalignment independently affects cognitive performance\n   • Integrates chronotype considerations into sleep-cognition research\n\n3. METHODOLOGICAL APPROACHES\n\n3.1 Sleep Assessment Methods\n   • Subjective measures: Pittsburgh Sleep Quality Index dominates (used in 68% of studies)\n   • Objective measures: Increasing use of actigraphy (37% of studies) and polysomnography (22%)\n   • Emerging trend: Consumer sleep tracking devices (9% of studies since 2020)\n   • Methodological gap: Limited validation studies comparing consumer devices to gold standards\n\n3.2 Cognitive Assessment Approaches\n   • Laboratory-based assessments: Most common for executive function and memory (76% of studies)\n   • Ecological momentary assessment: Growing approach for real-world cognitive performance (18%)\n   • Virtual reality testing environments: Emerging methodology (7% of recent studies)\n   • Methodological gap: Need for more standardized cognitive test batteries to improve cross-study comparison\n\n3.3 Study Designs\n   • Cross-sectional designs predominate (64% of studies)\n   • Longitudinal studies increasing but still limited (23%)\n   • Experimental sleep manipulation studies (13%)\n   • Methodological gap: Need for more longitudinal and interventional designs\n\n4. KEY FINDINGS BY COGNITIVE DOMAIN\n\n4.1 Executive Function\n   • Consistent evidence that poor sleep quality impairs working memory, cognitive flexibility, and inhibitory control\n   • Meta-analysis by Chen et al. (2021) shows moderate effect sizes (d = 0.41-0.58)\n   • Sleep fragmentation appears more detrimental than reduced total sleep time\n   • Research gap: Limited understanding of recovery trajectories following sleep improvement\n\n4.2 Attention and Processing Speed\n   • Strong evidence for impaired sustained attention with poor sleep quality\n   • Reaction time consistently affected even with modest sleep quality reduction\n   • Selective attention shows more resilience to sleep quality variations\n   • Research gap: Unclear dose-response relationship between sleep quality metrics and attention decrements\n\n4.3 Memory Consolidation\n   • Robust evidence that sleep quality affects declarative memory consolidation\n   • Slow-wave sleep quality specifically linked to episodic memory performance\n   • Mixed findings regarding procedural memory\n   • Research gap: Limited research on how improving sleep quality might enhance memory in adults with cognitive complaints\n\n4.4 Higher-Order Cognitive Functions\n   • Decision-making and risk assessment show sensitivity to sleep quality\n   • Creative problem-solving shows complex, sometimes contradictory relationships with sleep quality\n   • Social cognition emerging as affected by sleep quality\n   • Research gap: Limited research on complex real-world cognitive tasks\n\n5. MODERATING FACTORS\n\n5.1 Age-Related Considerations\n   • Older adults show different patterns of vulnerability to sleep quality disruption\n   • Some evidence for compensatory neural mechanisms in healthy aging\n   • Research gap: Limited studies directly comparing age groups within the same methodology\n\n5.2 Individual Differences\n   • Genetic factors (e.g., COMT, BDNF polymorphisms) moderate sleep-cognition relationships\n   • Pre-existing cognitive function creates baseline differences in vulnerability\n   • Research gap: Need for more personalized approaches to understanding sleep-cognition relationships\n\n6. INTERVENTIONAL APPROACHES\n\n6.1 Cognitive Outcomes of Sleep Interventions\n   • Cognitive behavioral therapy for insomnia shows promising cognitive benefits\n   • Mixed findings for pharmacological sleep interventions\n   • Emerging evidence for chronotherapy approaches\n   • Research gap: Few studies with long-term cognitive follow-up after sleep interventions\n\n7. RESEARCH GAPS AND FUTURE DIRECTIONS\n\n7.1 Methodological Recommendations\n   • Need for multimodal sleep assessment combining subjective and objective measures\n   • Standardization of cognitive assessment batteries to facilitate meta-analysis\n   • More longitudinal designs with repeated measures of both sleep and cognition\n\n7.2 Emerging Research Areas\n   • Sleep quality and technology use interactions\n   • Microstructural sleep features (sleep spindles, slow waves) and specific cognitive processes\n   • Integration of circadian factors with sleep quality metrics\n   • Precision approaches to sleep intervention based on cognitive profiles\n\n8. CONCLUSION\n\nThe literature strongly supports a significant relationship between sleep quality and cognitive performance across multiple domains. While theoretical frameworks have evolved to incorporate neurobiological mechanisms, methodological diversity creates challenges for synthesis. Future research should address identified gaps, particularly regarding standardized measurement approaches, intervention studies, and personalized factors that moderate the sleep-cognition relationship.\n```\n\n'Excellent,' the senior researcher nods. 'You've created a prompt that generates a truly comprehensive literature review. Notice how it systematically organizes the research into theoretical frameworks, methodological approaches, and findings by cognitive domain? This structured approach helps identify not just what we know, but the gaps in our knowledge and methodological limitations.'",
  "feedback": {
    "vague": "Your prompt lacks specificity. What kind of literature review? On what subject?",
    "missingPersona": "You need to specify a research role. Try 'As a Research Librarian...'",
    "missingFormat": "You haven't specified how to organize the review. Add 'synthesizing the information into thematic categories'.",
    "missingElements": "Your prompt is missing key review elements. Include 'identifying key theories, methodological approaches, major findings, and research gaps'.",
    "missingConstraints": "You haven't addressed literature constraints. Add 'using peer-reviewed sources from the past 10 years'.",
    "tooSimple": "Your literature review prompt is too basic. Include multiple elements and organizational requirements."
  },
  "xpReward": 100,
  "nextChallenge": 1
}
