{
  "id": "12-2",
  "name": "The Data Analyst",
  "type": "data_analysis",
  "description": "A senior researcher points to a terminal displaying a complex dataset. 'Effective data analysis requires both technical skill and interpretive insight,' they explain. 'Show me you can craft a prompt that generates thorough analytical approaches.'",
  "promptTask": "**Craft a Data Analysis Prompt**: As a Research Statistician (Role), develop a comprehensive data analysis plan (Task) for a longitudinal study examining the relationship between sleep patterns and academic performance in college students (Subject), including data cleaning procedures, descriptive statistics, inferential analyses, and visualization approaches (Elements), while addressing potential confounding variables and interpretation limitations (Requirements).",
  "solveConditions": {
    "keywords": ["develop", "create", "design", "outline", "formulate"],
    "target": "data analysis|statistical analysis|analysis plan",
    "requiredPersona": ["research statistician", "data scientist", "statistical analyst", "quantitative researcher"],
    "requiredFormat": ["comprehensive", "systematic", "thorough", "rigorous"],
    "requiredKeywordsContext": ["data cleaning", "descriptive", "inferential", "visualization", "confounding variables", "limitations"]
  },
  "successMessage": "The terminal processes your prompt, generating a comprehensive data analysis plan...\n\n```\nDATA ANALYSIS PLAN: SLEEP PATTERNS AND ACADEMIC PERFORMANCE\n\n1. DATASET OVERVIEW AND PREPARATION\n\n   1.1 Data Structure Assessment\n   • Identify variables: sleep metrics (duration, quality, timing), academic performance measures, demographic variables, potential confounders\n   • Assess data structure: repeated measures nested within individuals across multiple semesters\n   • Evaluate measurement frequency and consistency across time points\n   • Identify unique identifiers and relational structure between data tables\n\n   1.2 Data Cleaning Procedures\n   • Implement standardized naming conventions and coding schemes\n   • Identify and handle missing data: pattern analysis, multiple imputation for MAR data\n   • Detect and address outliers: statistical detection (±3 SD, Mahalanobis distance) with verification against original records\n   • Validate data against expected ranges and distributions\n   • Create analysis-ready dataset with appropriate documentation\n\n   1.3 Variable Transformation and Creation\n   • Calculate composite sleep quality scores from raw metrics\n   • Generate standardized academic performance measures across different courses\n   • Create temporal variables (e.g., weekday/weekend differences, exam proximity)\n   • Develop consistency and variability metrics for sleep patterns\n\n2. EXPLORATORY DATA ANALYSIS\n\n   2.1 Univariate Descriptive Statistics\n   • Compute measures of central tendency and dispersion for all variables\n   • Generate frequency distributions for categorical variables\n   • Assess normality of continuous variables (histograms, Q-Q plots, Shapiro-Wilk tests)\n   • Identify temporal trends in key variables across the study period\n\n   2.2 Bivariate Relationships\n   • Calculate correlation matrices for key continuous variables\n   • Generate contingency tables for categorical relationships\n   • Create scatterplots with LOESS smoothing for continuous relationships\n   • Examine sleep-academic performance relationships stratified by key demographics\n\n   2.3 Visualization Strategy\n   • Time-series plots of sleep patterns across academic year\n   • Heat maps of correlation matrices between sleep and performance metrics\n   • Violin plots comparing academic performance across sleep quality categories\n   • Spaghetti plots showing individual trajectories with overlaid group trends\n   • Interactive dashboards for exploring multivariate relationships\n\n3. INFERENTIAL ANALYSIS APPROACH\n\n   3.1 Primary Analysis: Multilevel Modeling\n   • Develop hierarchical linear models with repeated measures nested within students\n   • Model specification: academic performance as function of sleep metrics, time, and their interactions\n   • Random effects structure: random intercepts and slopes for key sleep predictors\n   • Model building strategy: sequential addition of predictors with likelihood ratio testing\n   • Handling of time: linear and non-linear (spline) approaches to capture semester patterns\n\n   3.2 Addressing Temporality and Causality\n   • Implement lagged analyses to examine sleep effects on subsequent performance\n   • Cross-lagged panel models to assess bidirectional relationships\n   • Fixed-effects models to control for time-invariant confounding\n   • Sensitivity analyses with different temporal lags\n\n   3.3 Moderation and Subgroup Analyses\n   • Test interactions between sleep metrics and demographic factors\n   • Examine differential effects across academic majors and course types\n   • Assess moderation by chronotype and baseline sleep habits\n   • Implement multi-group models for categorical moderators\n\n   3.4 Mediation Analysis\n   • Test potential mediators: cognitive function, emotional well-being, class attendance\n   • Implement longitudinal mediation models with appropriate temporal ordering\n   • Calculate direct and indirect effects with bootstrapped confidence intervals\n   • Assess moderated mediation where theoretically indicated\n\n4. ADVANCED ANALYTICAL APPROACHES\n\n   4.1 Pattern Recognition\n   • Implement latent class analysis to identify sleep pattern typologies\n   • Use sequence analysis to examine temporal sleep pattern sequences\n   • Apply machine learning clustering to identify homogeneous subgroups\n   • Validate identified patterns using split-sample approaches\n\n   4.2 Predictive Modeling\n   • Develop predictive models of academic risk based on sleep patterns\n   • Implement cross-validation to assess predictive accuracy\n   • Compare linear and non-linear prediction approaches\n   • Calculate practical metrics (sensitivity, specificity, ROC curves) for prediction quality\n\n5. ROBUSTNESS AND SENSITIVITY ANALYSES\n\n   5.1 Addressing Potential Confounding\n   • Identify and control for key confounders: course difficulty, workload, health status, substance use\n   • Implement propensity score methods to balance sleep pattern groups\n   • Conduct E-value calculations to assess robustness to unmeasured confounding\n   • Compare results across models with different confounder adjustment strategies\n\n   5.2 Missing Data Sensitivity\n   • Compare results across different missing data handling approaches\n   • Conduct pattern-mixture models to assess sensitivity to missing data mechanisms\n   • Implement worst-case scenario analyses for key findings\n\n   5.3 Analytical Decisions Sensitivity\n   • Assess robustness to different outlier handling approaches\n   • Compare results with alternative model specifications\n   • Implement Bayesian analyses with different prior specifications\n   • Examine consistency across parametric and non-parametric approaches\n\n6. INTERPRETATION FRAMEWORK\n\n   6.1 Effect Size Contextualization\n   • Calculate standardized effect sizes for key relationships\n   • Translate statistical findings into practical metrics (e.g., GPA points per hour of sleep)\n   • Compare effect sizes to relevant benchmarks from literature\n   • Develop visualizations to communicate practical significance\n\n   6.2 Limitations Identification\n   • Acknowledge measurement limitations (self-reported sleep data)\n   • Address potential selection and attrition biases\n   • Discuss generalizability boundaries\n   • Identify potential alternative explanations for key findings\n\n   6.3 Causal Inference Considerations\n   • Explicitly evaluate assumptions required for causal interpretation\n   • Apply causal inference frameworks where appropriate\n   • Discuss strength of evidence for causal relationships\n   • Identify critical experiments or measurements needed for stronger causal claims\n\n7. REPORTING STRATEGY\n\n   7.1 Results Presentation\n   • Develop clear tables summarizing key models and findings\n   • Create publication-quality visualizations highlighting main relationships\n   • Structure results to address primary and secondary research questions\n   • Include appropriate uncertainty metrics (confidence intervals, standard errors)\n\n   7.2 Reproducibility Measures\n   • Document all analysis decisions in analysis registry\n   • Provide annotated syntax for all analyses\n   • Create reproducible R Markdown or Jupyter notebooks\n   • Develop data dictionary and codebook for dataset\n```\n\n'Excellent,' the senior researcher nods. 'You've created a prompt that generates a truly comprehensive data analysis plan. Notice how it addresses not just the basic statistical tests, but also data preparation, exploratory analysis, advanced approaches, and interpretation frameworks? This systematic approach ensures that the analysis is both technically sound and yields meaningful insights.'",
  "feedback": {
    "vague": "Your prompt lacks specificity. What kind of data analysis? What dataset should it analyze?",
    "missingPersona": "You need to specify a data analysis role. Try 'As a Research Statistician...'",
    "missingElements": "You haven't specified the key analysis components. Include 'data cleaning procedures, descriptive statistics, inferential analyses, and visualization approaches'.",
    "missingRequirements": "You haven't addressed important analytical considerations. Add 'addressing potential confounding variables and interpretation limitations'.",
    "missingSubject": "Your prompt is missing a specific analysis subject. Include a clear topic like 'a longitudinal study examining the relationship between sleep patterns and academic performance in college students'.",
    "tooSimple": "Your data analysis prompt is too basic. Include multiple analytical elements and considerations."
  },
  "xpReward": 100,
  "nextChallenge": null
}
