{
  "id": "13-0",
  "name": "The Prompt Architect",
  "type": "meta_prompting",
  "description": "A Grand Master points to a terminal displaying a complex problem. 'True mastery includes the ability to design prompts that create other prompts,' they explain. 'Show me you can craft a meta-prompt that guides the creation of effective prompts.'",
  "promptTask": "**Craft a Meta-Prompt**: As a Prompt Engineering Instructor (Role), create a detailed guide (Task) for designing effective prompts for creative writing (Subject) that includes persona development, task specification, format requirements, and example structures (Elements), while ensuring the resulting prompts balance creative freedom with helpful constraints (Requirements).",
  "solveConditions": {
    "keywords": ["create", "design", "develop", "craft", "generate"],
    "target": "guide|framework|template|instructions|methodology",
    "requiredPersona": ["prompt engineering instructor", "prompt design teacher", "prompt architect", "prompt methodology expert"],
    "requiredFormat": ["detailed", "step-by-step", "comprehensive", "structured"],
    "requiredKeywordsContext": ["persona", "task specification", "format", "examples", "creative freedom", "constraints"]
  },
  "successMessage": "The terminal processes your prompt, generating a comprehensive meta-prompt guide...\n\n```\nPROMPT ENGINEERING GUIDE: CRAFTING EFFECTIVE CREATIVE WRITING PROMPTS\n\n1. INTRODUCTION TO CREATIVE WRITING PROMPT DESIGN\n\n   Creative writing prompts require a delicate balance between providing sufficient structure to inspire and guide writers, while allowing enough creative freedom for authentic expression. This guide will walk you through designing prompts that achieve this balance, helping writers overcome blocks while nurturing their unique voice.\n\n2. PERSONA ENGINEERING FOR CREATIVE WRITING PROMPTS\n\n   When designing the persona element of your prompt, consider:\n\n   2.1 Creative Roles Spectrum\n   • Literary Personas: Novelist, poet, playwright, essayist, short story writer\n   • Genre Specialists: Science fiction author, mystery writer, romance novelist\n   • Technical Roles: Editor, writing coach, literary agent, publisher\n   • Character Perspectives: First-person narrator, historical figure, fictional character\n\n   2.2 Persona Selection Principles\n   • Match the persona to the desired writing style and tone\n   • Consider how the persona influences perspective and voice\n   • Use personas to encourage writing outside one's comfort zone\n   • Ensure the persona has the appropriate expertise for the task\n\n   2.3 Persona Specification Template\n   \"As a [specific creative role] who specializes in [relevant genre/style/period], with a particular strength in [specific writing element]...\"\n\n   Examples:\n   • \"As a magical realism author who specializes in blending everyday settings with fantastical elements...\"\n   • \"As a nature poet known for vivid sensory imagery and contemplative themes...\"\n   • \"As a historical fiction writer who specializes in bringing Renaissance Italy to life...\"\n\n3. TASK SPECIFICATION FOR CREATIVE WRITING\n\n   The task element should clearly communicate what kind of writing is requested:\n\n   3.1 Task Clarity Components\n   • Writing Format: Story, poem, dialogue, scene, character sketch, etc.\n   • Length Parameters: Word count range, time to complete, structural units\n   • Creative Purpose: Entertain, inspire, provoke thought, evoke emotion\n   • Technical Focus: Develop specific writing skills or techniques\n\n   3.2 Task Complexity Levels\n   • Foundational: Single-focus exercises that develop specific skills\n   • Intermediate: Multi-element tasks that combine techniques\n   • Advanced: Complex, integrated writing challenges\n\n   3.3 Task Specification Template\n   \"Create a [specific format] about [subject/theme] that [purpose/goal], focusing on [technical element]...\"\n\n   Examples:\n   • \"Create a short story about an unexpected encounter that explores the theme of serendipity, focusing on dynamic character development through dialogue.\"\n   • \"Write a sonnet about the changing seasons that serves as a metaphor for personal transformation, focusing on vivid imagery and maintaining the traditional rhyme scheme.\"\n   • \"Develop a scene that introduces a detective character through their investigation methods rather than physical description, focusing on revealing personality through actions.\"\n\n4. SUBJECT AND CONTENT GUIDANCE\n\n   Provide appropriate direction for the writing's content:\n\n   4.1 Subject Specification Approaches\n   • Open-Ended Themes: Broad concepts allowing wide interpretation\n   • Specific Scenarios: Defined situations or premises\n   • Character-Driven: Focus on specific character types or interactions\n   • Setting-Based: Emphasis on place and environment\n   • Object-Centered: Writing that revolves around a specific item\n\n   4.2 Content Boundary Setting\n   • Inclusion Requirements: Elements that must appear\n   • Exclusion Guidelines: Approaches or elements to avoid\n   • Tone Parameters: Emotional quality of the writing\n   • Perspective Guidelines: Viewpoint considerations\n\n   4.3 Subject Specification Template\n   \"The [writing] should explore [theme/subject] through [approach], including [required elements] while avoiding [excluded elements]...\"\n\n   Examples:\n   • \"The story should explore the theme of isolation through a character stranded in a familiar but changed environment, including at least one moment of unexpected beauty while avoiding clichéd survival scenarios.\"\n   • \"The poem should examine the concept of home through sensory details, including both physical spaces and emotional associations while avoiding sentimentality.\"\n\n5. FORMAT AND STRUCTURAL REQUIREMENTS\n\n   Guide the organization and presentation of the writing:\n\n   5.1 Format Elements to Specify\n   • Structure: Chapters, stanzas, scenes, paragraphs, etc.\n   • Style: Literary techniques, voice, tense, person\n   • Technical Requirements: Dialogue format, description ratio, pacing\n   • Special Constraints: Word limits, included phrases, stylistic challenges\n\n   5.2 Balancing Structure and Freedom\n   • Provide scaffolding without restricting creativity\n   • Offer optional structural elements for writers needing more guidance\n   • Include format rationale to explain the purpose of constraints\n   • Allow for intentional rule-breaking when it serves the writing\n\n   5.3 Format Specification Template\n   \"Structure the [writing] with [format elements], written in [style/voice/tense], and incorporating [special requirements]...\"\n\n   Examples:\n   • \"Structure the story with three distinct scenes that gradually reveal the protagonist's motivation, written in close third-person perspective, and incorporating at least one flashback that changes the reader's understanding of current events.\"\n   • \"Format the poem as a villanelle with the traditional repeating line structure, written with a contemplative tone, and incorporating imagery from at least three different sensory domains.\"\n\n6. EXAMPLE INTEGRATION\n\n   Demonstrate the application of your prompt elements:\n\n   6.1 Example Functions\n   • Illustrate expected output format and quality\n   • Demonstrate creative possibilities within constraints\n   • Show different approaches to the same prompt\n   • Highlight particularly effective techniques\n\n   6.2 Example Implementation Approaches\n   • Full Examples: Complete responses to the prompt\n   • Partial Demonstrations: Excerpts showing specific elements\n   • Contrasting Examples: Effective vs. less effective approaches\n   • Annotated Samples: Examples with commentary on techniques\n\n   6.3 Example Integration Template\n   \"Here's an example of how this might be approached: [example]. Notice how it [highlight specific effective elements]...\"\n\n7. CONSTRAINTS AND CREATIVE FREEDOM BALANCE\n\n   Ensure your prompt provides both structure and space for creativity:\n\n   7.1 Productive Constraint Principles\n   • Constraints should spark creativity, not restrict it\n   • Technical challenges should serve the writing's purpose\n   • Requirements should be intentional and meaningful\n   • Limitations should create focus rather than frustration\n\n   7.2 Freedom Preservation Techniques\n   • Include open elements alongside structured requirements\n   • Offer multiple paths to satisfy constraints\n   • Explicitly encourage personal interpretation\n   • Validate experimentation and rule-bending\n\n   7.3 Balance Statement Template\n   \"While following these guidelines, feel free to [areas of creative freedom]. The constraints are designed to [purpose of constraints], not to limit your creative expression.\"\n\n   Examples:\n   • \"While following these structural guidelines, feel free to interpret the theme of 'boundaries' in any way that resonates with you. The three-part structure is designed to create a sense of progression, not to limit your creative approach to the subject.\"\n   • \"While incorporating these technical elements, feel free to develop your own unique voice and perspective. The dialogue requirements are designed to strengthen character development, not to prescribe how your characters should interact.\"\n\n8. COMPLETE CREATIVE WRITING PROMPT TEMPLATES\n\n   8.1 Short Story Prompt Template\n   \"As a [specific fiction writer type], create a short story about [theme/subject] that [purpose/goal]. The story should include [character/plot elements] and be structured with [format requirements]. Focus on developing [specific writing skills] while [technical challenge]. While following these guidelines, feel free to [creative freedom areas].\"\n\n   8.2 Poetry Prompt Template\n   \"As a [specific poet type], compose a [poetry form] about [theme/subject] that [purpose/goal]. The poem should include [imagery/language elements] and follow [structural requirements]. Pay particular attention to [poetic devices] while [technical challenge]. Within these parameters, express your unique perspective on [theme].\"\n\n   8.3 Character Development Prompt Template\n   \"As a [specific writer type], create a character sketch for a [character type] who [distinguishing situation/trait]. Reveal their personality through [development methods] rather than direct description. Include [required elements] while avoiding [clichés to avoid]. The sketch should [format requirements] and demonstrate [writing technique]. Feel free to [creative freedom areas].\"\n\n9. EVALUATION CRITERIA FOR CREATIVE WRITING PROMPTS\n\n   Assess your prompt design using these criteria:\n\n   9.1 Clarity and Specificity\n   • Are all requirements clearly communicated?\n   • Is there a clear creative goal?\n   • Would writers of different experience levels understand the task?\n\n   9.2 Inspiration and Engagement\n   • Does the prompt spark interest and curiosity?\n   • Does it offer meaningful creative challenges?\n   • Would it engage writers with different interests?\n\n   9.3 Balance and Flexibility\n   • Does it provide structure without over-constraining?\n   • Are there multiple valid approaches to the prompt?\n   • Does it allow for personal style and voice?\n\n   9.4 Skill Development\n   • Does it target specific writing skills?\n   • Would completing it teach something valuable?\n   • Is there room for both success and growth?\n\n10. COMMON PITFALLS IN CREATIVE WRITING PROMPT DESIGN\n\n    10.1 Overly Prescriptive Elements\n    • Too many specific requirements that leave no room for creativity\n    • Dictating content rather than inspiring it\n    • Focusing on rules rather than creative expression\n\n    10.2 Vague or Unfocused Direction\n    • Prompts so open-ended they provide no guidance\n    • Unclear expectations about format or outcome\n    • Lack of purpose or skill-building focus\n\n    10.3 Mismatched Components\n    • Persona that doesn't align with the requested task\n    • Technical requirements that fight against the content\n    • Constraints that serve no meaningful purpose\n\n    10.4 Missing Inspiration Elements\n    • Mechanical exercises without creative spark\n    • Focus on technique without emotional engagement\n    • Neglecting the joy and discovery of creative writing\n```\n\n'Excellent,' the Grand Master nods. 'You've created a meta-prompt that effectively guides the creation of creative writing prompts. Notice how it addresses both structure and creative freedom, providing templates while encouraging customization? This balance is the hallmark of effective meta-prompting.'",
  "feedback": {
    "vague": "Your prompt lacks specificity. What kind of prompts should the guide help create?",
    "missingPersona": "You need to specify an instructional role. Try 'As a Prompt Engineering Instructor...'",
    "missingElements": "You haven't specified the key components to include. Add 'persona development, task specification, format requirements, and example structures'.",
    "missingRequirements": "You haven't addressed the balance needed. Add 'ensuring the resulting prompts balance creative freedom with helpful constraints'.",
    "missingSubject": "Your prompt is missing a specific subject focus. Include a clear domain like 'for creative writing'.",
    "tooSimple": "Your meta-prompt is too basic. Include multiple instructional elements and design considerations."
  },
  "xpReward": 150,
  "nextChallenge": 1
}
