{
  "id": "13-3",
  "name": "The Grand Master",
  "type": "integrated_prompting",
  "description": "You approach a magnificent crystal sphere at the center of the citadel. The Grand Master gestures toward it. 'The ultimate test of mastery is integration - combining multiple techniques into a cohesive whole. Show me you can craft an integrated prompt that weaves together multiple advanced techniques.'",
  "promptTask": "**Craft an Integrated Prompt**: As a Knowledge Integration Specialist (Role), create a comprehensive research synthesis protocol (Task) for analyzing climate change adaptation strategies (Subject) that combines systems thinking, cross-disciplinary integration, stakeholder perspective mapping, and evidence quality assessment (Elements), while balancing scientific rigor with practical implementation guidance for policymakers (Requirements).",
  "solveConditions": {
    "keywords": ["create", "design", "develop", "craft", "generate"],
    "target": "research synthesis protocol|knowledge integration framework|synthesis methodology|integrated analysis approach",
    "requiredPersona": ["knowledge integration specialist", "research synthesis expert", "interdisciplinary researcher", "systems analyst"],
    "requiredFormat": ["comprehensive", "integrated", "systematic", "multi-dimensional"],
    "requiredKeywordsContext": ["systems thinking", "cross-disciplinary", "stakeholder perspective", "evidence quality", "scientific rigor", "practical implementation"]
  },
  "successMessage": "The crystal sphere pulses with energy as it processes your prompt...\n\n```\nCOMPREHENSIVE CLIMATE ADAPTATION RESEARCH SYNTHESIS PROTOCOL\n\nI. FOUNDATION & FRAMING\n\n1. Systemic Context Mapping\n   a. Identify key climate systems affected (ecological, social, economic, infrastructure)\n   b. Map cross-system interactions and feedback loops\n   c. Establish temporal scales for analysis (immediate, mid-term, long-term impacts)\n   d. Define geographical and jurisdictional boundaries while noting cross-boundary effects\n\n2. Knowledge Landscape Assessment\n   a. Catalog relevant disciplines (climate science, economics, public health, urban planning, etc.)\n   b. Identify disciplinary paradigms, methodologies, and key debates\n   c. Map conceptual overlaps and divergences between disciplines\n   d. Assess knowledge gaps and areas of disciplinary isolation\n\n3. Stakeholder Ecosystem Analysis\n   a. Identify stakeholder categories (policymakers, vulnerable communities, industry, etc.)\n   b. Map power dynamics and representation disparities\n   c. Document diverse knowledge systems (scientific, indigenous, practitioner)\n   d. Analyze stakeholder decision contexts and constraints\n\nII. EVIDENCE COLLECTION & EVALUATION\n\n4. Multi-dimensional Evidence Gathering\n   a. Scientific literature (peer-reviewed research, technical reports, models)\n   b. Practice-based evidence (case studies, implementation reports, evaluations)\n   c. Stakeholder knowledge (community experiences, traditional knowledge, expert judgment)\n   d. Policy landscapes (existing frameworks, regulatory contexts, governance structures)\n\n5. Evidence Quality Assessment Framework\n   a. Scientific evidence: Methodological rigor, statistical validity, replicability\n   b. Practice evidence: Context documentation, outcome measurement, transferability\n   c. Stakeholder knowledge: Representativeness, consistency, triangulation\n   d. Integrated assessment: Convergence across evidence types, explanatory power\n\n6. Uncertainty Characterization\n   a. Typology of uncertainties (statistical, methodological, epistemic, ontological)\n   b. Confidence level assessment for key findings\n   c. Implications of uncertainties for different stakeholders\n   d. Strategies for decision-making under different uncertainty conditions\n\nIII. INTEGRATION & SYNTHESIS\n\n7. Cross-disciplinary Integration Methodology\n   a. Concept harmonization across disciplinary boundaries\n   b. Development of integrated analytical frameworks\n   c. Resolution protocols for paradigmatic conflicts\n   d. Synthesis of complementary methodological approaches\n\n8. Multi-scale Pattern Recognition\n   a. Identification of recurring adaptation patterns across contexts\n   b. Analysis of scale-dependent factors (local to global)\n   c. Temporal pattern analysis (short-term responses vs. transformational change)\n   d. Cross-contextual success factor identification\n\n9. Trade-off and Synergy Analysis\n   a. Systematic identification of potential co-benefits\n   b. Assessment of trade-offs across sectors and stakeholders\n   c. Temporal trade-off analysis (present vs. future benefits)\n   d. Distributional impact analysis (equity implications)\n\nIV. KNOWLEDGE TRANSLATION & APPLICATION\n\n10. Policy Implication Extraction\n    a. Identification of actionable insights for different governance levels\n    b. Alignment with existing policy frameworks and processes\n    c. Assessment of implementation feasibility and constraints\n    d. Development of decision support tools calibrated to policy contexts\n\n11. Stakeholder-Specific Knowledge Products\n    a. Tiered communication strategy for different knowledge needs\n    b. Uncertainty communication appropriate to stakeholder context\n    c. Visualization of complex relationships and trade-offs\n    d. Integration of scientific findings with implementation guidance\n\n12. Implementation Pathway Mapping\n    a. Identification of sequenced action steps across time horizons\n    b. Specification of enabling conditions for successful implementation\n    c. Anticipation of implementation barriers and mitigation strategies\n    d. Design of monitoring frameworks for adaptive management\n\nV. META-PROCESS ELEMENTS\n\n13. Reflexivity and Bias Mitigation\n    a. Explicit acknowledgment of normative assumptions\n    b. Strategies for minimizing disciplinary and cultural bias\n    c. Transparency about synthesis team composition and process\n    d. Critical examination of framing effects on findings\n\n14. Synthesis Process Documentation\n    a. Methodological transparency for all synthesis steps\n    b. Documentation of integration challenges and resolution approaches\n    c. Archiving of evidence evaluation decisions\n    d. Accessibility considerations for process documentation\n\n15. Adaptive Synthesis Framework\n    a. Mechanisms for incorporating new evidence over time\n    b. Processes for revisiting synthesis conclusions as contexts change\n    c. Learning integration from implementation experiences\n    d. Continuous stakeholder feedback loops\n\nVI. PRACTICAL APPLICATION GUIDANCE\n\n16. Decision-Maker Implementation Toolkit\n    a. Policy briefing templates tailored to governance levels\n    b. Decision trees for adaptation option assessment\n    c. Stakeholder engagement protocols for adaptation planning\n    d. Monitoring and evaluation frameworks for adaptive management\n\n17. Context Localization Methodology\n    a. Procedures for calibrating findings to local conditions\n    b. Assessment tools for local capacity and constraints\n    c. Methods for integrating local knowledge with synthesis findings\n    d. Participatory processes for local priority-setting\n\n18. Science-Policy-Practice Interface Enhancement\n    a. Ongoing dialogue mechanisms between researchers and decision-makers\n    b. Rapid response protocols for emerging adaptation challenges\n    c. Collaborative knowledge production frameworks\n    d. Boundary organization engagement strategies\n```\n\nThe sphere glows brilliantly as your integrated prompt is processed, then projects a holographic image of interconnected systems and knowledge flows.\n\n'Magnificent,' the Grand Master says with genuine admiration. 'You've created a truly integrated prompt that weaves together multiple advanced techniques. Notice how it combines systems thinking through its interconnected framework, cross-disciplinary integration through its methodological approach, stakeholder perspective mapping across different knowledge needs, and evidence quality assessment with rigorous evaluation criteria. Most importantly, it balances scientific rigor with practical implementation guidance specifically designed for policymakers.'\n\nThe Grand Master gestures to the crystal sphere, which now shines with an inner light. 'You have demonstrated mastery of all the prompt engineering skills taught throughout the PromptCraft Dungeon. You are now a true PromptCraft Engineer!'",
  "feedback": {
    "vague": "Your prompt lacks specificity. What kind of integration should it create?",
    "missingPersona": "You need to specify a knowledge integration role. Try 'As a Knowledge Integration Specialist...'",
    "missingElements": "You haven't specified the key integration components. Include 'systems thinking, cross-disciplinary integration, stakeholder perspective mapping, and evidence quality assessment'.",
    "missingRequirements": "You haven't addressed the balance requirements. Add 'balancing scientific rigor with practical implementation guidance for policymakers'.",
    "missingSubject": "Your prompt is missing a specific subject focus. Include a clear domain like 'for analyzing climate change adaptation strategies'.",
    "tooSimple": "Your integrated prompt is too basic. It needs to combine multiple advanced techniques into a cohesive framework."
  },
  "xpReward": 200,
  "nextChallenge": "completion"
}
